#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

int main() {

	//整形数组初始化
	int arr1[10] = { 0,1,2,3,4,5,6,7,8,9 };//完全初始化(10个元素集合)
	int arr2[10] = { 0,1,2,3,4,5 };//不完全初始化----不够的补'0'(10个元素集合)
	int arr3[] = { 0,1,2,3,4,5,6,7,8,9 };//根据后面的元素确定[]里的常量(5个元素集合)
	int arr[10] = { 0 };//默认10个元素都是0;

	//字符数组初始化
	char ch_1[5] = {'b','i','t','l','l'}; //完全初始化(5个元素集合)
	char ch_2[5] = { 'b','i','t' };//不完全初始化----不够的补'\0'(5个元素集合)

	char ch_3[5] = "bitll";//完全初始化(5个元素集合)
	char ch_4[] = "bit";//根据后面的元素确定前面的[]里的产量(3个元素集合)

	char ch_5[] = "bit";//内存中是bit\0
	char ch_6[] = { 'b','i','t' };//内存中一直找到\0为止无法确定t后的数据 (随机值)


	//二维数组初始化
	int arr_a[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };//完全初始化
	int arr_b[3][4] = { 1,2,3,4,5 };//不完全初始化
	int arr_c[3][4] = { {1,2,3,4},{5,6,7,8} ,{9,10,11,12} };//完全初始化  [3][4]:三行四列 3不可以不写 ,4可以不写


	//指针初始化

	//当前不知道P应该初始化围殴声明地址的时候直接初始化NULL
	int* p = NULL;

	//C语言不会检查指针是空指针 使用前检查
	if (*p != NULL) {
		*p = 10;
	}
		
	return 0;
}
